Revit 2027 API
WallpaintApplicationType Enumeration
 The enumerated type representing the permitted values for the asset property "WallpaintApplication" from the "WallPaint" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum WallpaintApplicationType
Public Enumeration WallpaintApplicationType
public enum class WallpaintApplicationType
type WallpaintApplicationType
Members
Member name | Value | Description
Brush | 1
Roller | 0
Spray | 2
See Also
Reference
Autodesk.Revit.DB.Visual Namespace